In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder

In [82]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")
full_data = pd.concat([train, test], sort=True)
data_cleaner = [train, test]

In [59]:
print(train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

In [81]:
full_data.sample(10)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
349,42.0,NaN,S,8.6625,"Dimic, Mr. Jovan",0,350,3,male,0,0.0,315088
451,NaN,NaN,S,19.9667,"Hagland, Mr. Ingvald Olai Olsen",0,452,3,male,1,0.0,65303
102,NaN,NaN,Q,7.7500,"Foley, Mr. William",0,994,3,male,0,NaN,365235
682,20.0,NaN,S,9.2250,"Olsvigen, Mr. Thor Anderson",0,683,3,male,0,0.0,6563
16,2.0,NaN,Q,29.1250,"Rice, Master. Eugene",1,17,3,male,4,0.0,382652
823,27.0,E121,S,12.4750,"Moor, Mrs. (Beila)",1,824,3,female,0,1.0,392096
331,45.5,C124,S,28.5000,"Partner, Mr. Austen",0,332,1,male,0,0.0,113043
486,35.0,C93,S,90.0000,"Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)",0,487,1,female,1,1.0,19943
274,NaN,NaN,C,7.2250,"Saade, Mr. Jean Nassr",0,1166,3,male,0,NaN,2676
789,46.0,B82 B84,C,79.2000,"Guggenheim, Mr. Benjamin",0,790,1,male,0,0.0,PC 17593

In [80]:
full_data.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [70]:
for row in data_cleaner:
    row['Age'].fillna(row['Age'].median(), inplace = True)
    
print(train.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [83]:
full_data.info()
full_data['Age'] = lambda x: x['Age'].fillna(x['Age'].median(), inplace = True)
full_data['Embarked'] = lambda x: x['Embarked'].fillna(x['Embarked'].mode(), inplace = True)
full_data['Fare'] = lambda x: x['Fare'].fillna(x['Fare'].median(), inplace = True)
full_data.drop(['Cabin', 'PassengerId', 'Ticket'], axis=1, inplace=True)
full_data.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1309 non-null object
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1309 non-null object
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(1), int64(4), object(7)
memory usage: 132.9+ KB

Age           0
Embarked      0
Fare          0
Name          0
Parch         0
Pclass        0
Sex           0
SibSp         0
Survived    418
dtype: int64

In [96]:
for dataset in [train, test]:

    
    dataset['Age']      = lambda x: x['Age'].fillna(x['Age'].median(), inplace = True)
    dataset['Embarked'] = lambda x: x['Embarked'].fillna(x['Embarked'].mode(), inplace = True)
    dataset['Fare']     = lambda x: x['Fare'].fillna(x['Fare'].median(), inplace = True)
train.drop(['Cabin', 'PassengerId', 'Ticket'], axis=1, inplace=True)

print("Training set:\n",train.isnull().sum())
print("-" * 10)
print("Test set:\n",test.isnull().sum())

train set
 Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64
----------
test set
 PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [84]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [83]:
train.shape

(891, 12)

In [81]:
train.size

10692

In [65]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [85]:
train.isnull().sum()

# there is a huge % of Cabin missing from the dataset. I think the best thing to do with this is drop it entirely

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [86]:
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [87]:
train.Age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [73]:
train.Cabin.head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [74]:
train.Embarked.head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [12]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [57]:
# mark train.Age's zero values as NaN
train[['Age']] = train[['Age']].replace(0, np.NaN)

In [58]:
# fill NaN values with mean column values
train.fillna(train.mean(), inplace=True)

In [59]:
# recount NaN's
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [8]:
len(train.columns)

12

In [9]:
len(test.columns)

11

In [11]:
train.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [13]:
train[['Fare', 'Survived']].corr()

              Fare  Survived
Fare      1.000000  0.257307
Survived  0.257307  1.000000

In [13]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [19]:
train[['Pclass', 'Survived']].groupby(['Pclass'], as_index=False).mean()

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [25]:
train[['Sex', 'Survived']].groupby(['Sex'], as_index=False).mean()

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [42]:
full_data = pd.concat([train, test], sort=True)
full_data.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [54]:
# looks like PassengerId is a drop
full_data.PassengerId.value_counts().head()

1309    1
449     1
431     1
432     1
433     1
Name: PassengerId, dtype: int64

In [55]:
# drop candidate
full_data.Ticket.value_counts()

CA. 2343             11
CA 2144               8
1601                  8
S.O.C. 14879          7
347077                7
3101295               7
PC 17608              7
347082                7
19950                 6
382652                6
347088                6
113781                6
220845                5
PC 17757              5
4133                  5
W./C. 6608            5
349909                5
16966                 5
113503                5
PC 17483              4
2666                  4
W./C. 6607            4
C.A. 33112            4
C.A. 34651            4
17421                 4
113760                4
LINE                  4
C.A. 2315             4
12749                 4
36928                 4
                     ..
110469                1
349911                1
PC 17610              1
2667                  1
349208                1
3101296               1
A.5. 3236             1
367655                1
349241                1
244278                1
2677                  1
8475                  1
383121                1
PC 17594              1
STON/O 2. 3101286     1
234818                1
248706                1
PC 17609              1
370375                1
347069                1
237393                1
A/4 48873             1
29104                 1
113050                1
350048                1
694                   1
349207                1
SOTON/O.Q. 392078     1
4134                  1
349216                1
Name: Ticket, Length: 929, dtype: int64

In [58]:
# cabin has too much missing data, will drop
full_data.Cabin.value_counts().head()

C23 C25 C27        6
G6                 5
B57 B59 B63 B66    5
F33                4
C78                4
Name: Cabin, dtype: int64

In [52]:
# looks like most people embarked from Southampton, C = Cherbourg, Q = Queenstown
full_data.Embarked.value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [6]:
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1

train['IsAlone'] = 1
train['IsAlone'].loc[train['FamilySize'] > 1] = 0

C:\Anaconda3\lib\site-packages\pandas\core\indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [11]:
train.Name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [15]:
train['Title'] = train['Name'].str.split(", ", expand=True)[1].str.split(".", expand=True)[0]
train.Title.head()

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Title, dtype: object

In [17]:
# bucket Fare and Age
train['FareBin'] = pd.qcut(train['Fare'], 4)
train['AgeBin'] = pd.cut(train['Age'],5)

In [20]:
train.AgeBin

0      (16.336, 32.252]
1      (32.252, 48.168]
2      (16.336, 32.252]
3      (32.252, 48.168]
4      (32.252, 48.168]
5                   NaN
6      (48.168, 64.084]
7        (0.34, 16.336]
8      (16.336, 32.252]
9        (0.34, 16.336]
10       (0.34, 16.336]
11     (48.168, 64.084]
12     (16.336, 32.252]
13     (32.252, 48.168]
14       (0.34, 16.336]
15     (48.168, 64.084]
16       (0.34, 16.336]
17                  NaN
18     (16.336, 32.252]
19                  NaN
20     (32.252, 48.168]
21     (32.252, 48.168]
22       (0.34, 16.336]
23     (16.336, 32.252]
24       (0.34, 16.336]
25     (32.252, 48.168]
26                  NaN
27     (16.336, 32.252]
28                  NaN
29                  NaN
             ...
861    (16.336, 32.252]
862    (32.252, 48.168]
863                 NaN
864    (16.336, 32.252]
865    (32.252, 48.168]
866    (16.336, 32.252]
867    (16.336, 32.252]
868                 NaN
869      (0.34, 16.336]
870    (16.336, 32.252]
871    (32.252, 48.168]
872    (32.252, 48.168]
873    (32.252, 48.168]
874    (16.336, 32.252]
875      (0.34, 16.336]
876    (16.336, 32.252]
877    (16.336, 32.252]
878                 NaN
879    (48.168, 64.084]
880    (16.336, 32.252]
881    (32.252, 48.168]
882    (16.336, 32.252]
883    (16.336, 32.252]
884    (16.336, 32.252]
885    (32.252, 48.168]
886    (16.336, 32.252]
887    (16.336, 32.252]
888                 NaN
889    (16.336, 32.252]
890    (16.336, 32.252]
Name: AgeBin, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,None,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,None,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,None,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,None,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,None,1,1,3101298,12.2875,NaN,S

In [50]:
train['Age'].fillna(train['Age'].median(), inplace=True)
train.head(25)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,28.0,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,28.0,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S

In [77]:


def impute(df):
    """Impute and drop relevant variables
    
    Parameters
    ----------
    train_set : DataFrame of the training set
    test_set : DataFrame of the test set
        Impute the median for NaNs in the Age column, mode in the Embarked
        column, and median in the Fare column.
        Drop Cabin, PassengerId, and Ticket columns in the training set.
        
    Returns
    -------
    train_set : Imputed DataFrame of the training set
    test_set : Imputed DataFrame of the test set
    """  
       
    df['Age'].fillna(df['Age'].median(), inplace = True)
    df['Embarked'].fillna(df['Embarked'].mode(), inplace = True)
    df['Fare'].fillna(df['Fare'].median(), inplace = True)
        
#     train_set.drop(['Cabin', 'PassengerId', 'Ticket'], axis=1, inplace=True) # drop from training set only
     
    return df

In [83]:
train_set = (train
     .drop(['Cabin', 'PassengerId', 'Ticket'], axis=1, inplace=False)
     .pipe(impute))

test_set = (test
     .pipe(impute))

train_set.head(50)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S
5,0,3,"Moran, Mr. James",male,28.0,0,0,8.4583,Q
6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,S
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,21.0750,S
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,11.1333,S
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,30.0708,C
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,16.7000,S
11,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,S
12,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,8.0500,S
13,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,31.2750,S
14,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,7.8542,S
15,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,16.0000,S
16,0,3,"Rice, Master. Eugene",male,2.0,4,1,29.1250,Q
17,1,2,"Williams, Mr. Charles Eugene",male,28.0,0,0,13.0000,S
18,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,18.0000,S
19,1,3,"Masselmani, Mrs. Fatima",female,28.0,0,0,7.2250,C
20,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,26.0000,S
21,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,13.0000,S
22,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,8.0292,Q
23,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,35.5000,S
24,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,21.0750,S
25,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,31.3875,S
26,0,3,"Emir, Mr. Farred Chehab",male,28.0,0,0,7.2250,C
27,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,263.0000,S
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,28.0,0,0,7.8792,Q
29,0,3,"Todoroff, Mr. Lalio",male,28.0,0,0,7.8958,S
30,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,27.7208,C
31,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,28.0,1,0,146.5208,C
32,1,3,"Glynn, Miss. Mary Agatha",female,28.0,0,0,7.7500,Q
33,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,10.5000,S
34,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,82.1708,C
35,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,52.0000,S
36,1,3,"Mamee, Mr. Hanna",male,28.0,0,0,7.2292,C
37,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,8.0500,S
38,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,18.0000,S
39,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,11.2417,C
40,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,9.4750,S
41,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,21.0000,S
42,0,3,"Kraeff, Mr. Theodor",male,28.0,0,0,7.8958,C
43,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,41.5792,C
44,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,7.8792,Q
45,0,3,"Rogers, Mr. William John",male,28.0,0,0,8.0500,S
46,0,3,"Lennon, Mr. Denis",male,28.0,1,0,15.5000,Q
47,1,3,"O'Driscoll, Miss. Bridget",female,28.0,0,0,7.7500,Q
48,0,3,"Samaan, Mr. Youssef",male,28.0,2,0,21.6792,C
49,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,17.8000,S